import matplotlib.pyplot as plt
import pandas as pd


student_grades = {
    "Алексей": {"Математика": 4, "Физика": 3, "Химия": 5, "История": 4, "Литература": 3},
    "Борис": {"Математика": 3, "Физика": 4, "Химия": 3, "История": 5, "Литература": 4},
    "Виктория": {"Математика": 5, "Физика": 5, "Химия": 4, "История": 4, "Литература": 5},
    "Галина": {"Математика": 4, "Физика": 3, "Химия": 4, "История": 5, "Литература": 5},
    "Дмитрий": {"Математика": 3, "Физика": 4, "Химия": 5, "История": 3, "Литература": 4},
    "Екатерина": {"Математика": 5, "Физика": 5, "Химия": 5, "История": 4, "Литература": 5},
    "Иван": {"Математика": 4, "Физика": 4, "Химия": 3, "История": 5, "Литература": 4},
    "Людмила": {"Математика": 3, "Физика": 5, "Химия": 4, "История": 4, "Литература": 3},
    "Мария": {"Математика": 5, "Физика": 4, "Химия": 5, "История": 5, "Литература": 5},
    "Николай": {"Математика": 3, "Физика": 3, "Химия": 4, "История": 4, "Литература": 4}
}

df = pd.DataFrame(student_grades).T
print(df.head())
df_means = pd.DataFrame({'mean': df.mean(), 'median': df.median()})
print(df_means)

q1_math = df['Математика'].quantile(0.25)
q3_math = df['Математика'].quantile(0.75)
IQR = q3_math - q1_math
df.boxplot(column=['Математика'])
plt.show()